**free

dcl-ds Customer_t qualified template;
  id int(10);
  name varchar(100);
  email varchar(100);
  status char(1);
end-ds;

dcl-c STATUS_ACTIVE 'A';
dcl-c STATUS_INACTIVE 'I';
